<template>
<b-container>
    <b-card style="max-width:70rem; border-color: #A48282; max-height: 52rem;">
      <b-row>
        <b-col>
          <span style="margin-left:7px; font-size:large; color: #064635; text-align: left;">자유게시판 </span>
          
          <hr>
          <b-table fixed hover :items="items_popular" class="common">
          </b-table>
        </b-col>
      </b-row>
    </b-card>
<br>
    
  </b-container>
</template>

<script>
export default {
  data() {
    return {
        items_popular: [
        { '번호': '102', '제목': '오픽 공부 하기 싫다', '글쓴이': 'Super_Mario', '날짜' : '22.07.21', '조회수': '7,799'},
        { '번호': '101', '제목': '삼수 끝의 정보처리기사 합격 후기...', '글쓴이': 'Bat_Man', '날짜' : '22.07.21', '조회수': '8,677'},
        { '번호': '100', '제목': 'toeic speaking honey tip 제공합니다 드루오세요', '글쓴이': 'Cinderellla', '날짜' : '22.07.21', '조회수': '4.1만'},
        { '번호': '99', '제목': '정보보안기사 따면 좋나요?', '글쓴이': 'Brown_Cat', '날짜' : '22.07.21', '조회수': '2.1만'},
        { '번호': '98', '제목': '오픽 보고 왔는데 네 번 연속 IH.. AL 포기 할까요', '글쓴이': 'Oh_My_Boy', '날짜' : '22.07.21', '조회수': '1만'},
        { '번호': '97', '제목': '오픽 공부 하기 싫다ㅜㅜ', '글쓴이': 'Giri_Girl', '날짜' : '22.07.21', '조회수': '7,799' },
        { '번호': '96', '제목': '네트워크는 어려워', '글쓴이': 'science_joa', '날짜' : '22.07.21', '조회수': '811' },
        { '번호': '95', '제목': '토익스피킹 공부하는데 현타가..', '글쓴이': 'Super_Mario', '날짜' : '22.07.21', '조회수': '1,334'},
        { '번호': '94', '제목': '정보보안기사 따면 좋나요?', '글쓴이': 'Bat_man', '날짜' : '22.07.21', '조회수': '2.1만'},
        { '번호': '93', '제목': '오픽 보고 왔는데 네 번 연속 IH..', '글쓴이': 'heo_gak', '날짜' : '22.07.21', '조회수': '1만'},
        { '번호': '92', '제목': 'toeic speaking honey tip 제...', '글쓴이': 'eunji', '날짜' : '22.07.21', '조회수': '4.1만'},
        { '번호': '91', '제목': '오픽 꿀팁!', '글쓴이': 'jaehyuni', '날짜' : '22.07.21', '조회수': '1만'},
        { '번호': '90', '제목': '토익스피킹 나만의 꿀팁..', '글쓴이': 'sehan', '날짜' : '22.07.21', '조회수': '3만'},
        { '번호': '89', '제목': '정보보안기사 꿀팁입니다', '글쓴이': 'kyojun', '날짜' : '22.07.21', '조회수': '2만'},
        { '번호': '88', '제목': '한능검 꿀팁 드려요', '글쓴이': 'aeri', '날짜' : '22.07.21', '조회수': '5,444'},
        { '번호': '87', '제목': '오픽 세 번 만의 AL 달성 후기', '글쓴이': 'jonghwan', '날짜' : '22.07.21', '조회수': '1,799'},
      ]     
  }
  }
}
</script>

<style>
.common{
  margin-bottom: 1.8rem;
  border-color: #e4dada;
  max-width: 70rem; 
  max-height: 12rem;
}
</style>